file/GuideQuality.html
<?xml version="1.0" encoding="gbk"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Guide 品质</title>
<meta http-equiv="Content-Type" content="text/html;charset=gbk"/>
<meta name="title" content="Guide 品质"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-09-04T12:23+0800"/>
<meta name="author" content=""/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Guide 品质</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Content</a>
<ul>
<li><a href="#sec-1-1">1.1 起源</a></li>
<li><a href="#sec-1-2">1.2 说明</a></li>
<li><a href="#sec-1-3">1.3 一般流程</a></li>
<li><a href="#sec-1-4">1.4 完整流程</a></li>
<li><a href="#sec-1-5">1.5 特殊情况</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Content</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 起源</h3>
<div class="outline-text-3" id="text-1-1">

<ul>
<li>日本方面给了一些基准的道路和诱导点要求。
</li>
<li>我们要针对他们给的基准进行测试，是不是达到了诱导要求。
</li>
<li>这个时候就会发生：他们给的起，止点生成的路，和我们生成的，不一致的问题。
</li>
<li>如何解决这个不一致带来的诱导品质不佳的问题？
</li>
<li>修改道路，去匹配日本方面给的基准道路。
</li>
</ul>

</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 说明</h3>
<div class="outline-text-3" id="text-1-2">

<ul>
<li>诱导点的划分：
<ul>
<li>弱点：不是很重要的点，有了最好，没有也没事。
</li>
<li>特定点：一定要诱导的点，没有，没分，主要是一些长距离的道路
</li>
<li>特征点：一些特殊情况的点。
</li>
<li>差分：  还不知道？？？？？？？
</li>
</ul>

</li>
<li>分数说明：
<ul>
<li>每个点都有不同的分数。特定点的最高。
</li>
<li>每个诱导点类型，要达到相应的分数才行。
</li>
</ul>

</li>
</ul>

</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> 一般流程</h3>
<div class="outline-text-3" id="text-1-3">

<ul>
<li>去ici网站查看道路分数
<ul>
<li><a href="http://ici/view/2.QualityCheck/">guide品质检查</a>
</li>
</ul>

</li>
<li>选择分数低的道路，查看相应道路情况
<ul>
<li>会显示：我们生成的GuidePoint 与日本给的基准点不一致的情况
</li>
</ul>

</li>
<li>新建Path：主要功能都在鼠标右键
<ul>
<li>去网址：<a href="http://172.26.11.39:8005/JP">新建Path</a>
</li>
<li>找对应的起止点：<a href="http://naviqc-course/UploadCourse">上传的网址</a> 下有一个Detail，显示所有道路信息。
</li>
<li>在 新建Path 的网址上设置相应的起止点，会自动生成一条Path。
</li>
</ul>

</li>
<li>对比生成的Path与日本方面的基准Path的不同。
</li>
<li>去 新建Path网下，去设置起止点，设置途径地，让生成的Path与日本方面的Path相一致。
</li>
<li>从新建Path 下导出符合要求的Path 的 Json信息。
</li>
<li>替换掉已有的 Path<sub>json下的</sub> Path<sub>info</sub> 信息。
</li>
<li>去上传的网址，上传替换后的Path<sub>json</sub>   
</li>
<li>查看结果：上传网址 -&gt;  Detail -&gt; 对应的道路。
</li>
</ul>


</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> 完整流程</h3>
<div class="outline-text-3" id="text-1-4">

<ul>
<li>获取日本方面的基准信息（这个我还不知道怎么获取的）一般是.xls文件
</li>
<li>利用脚本去获取 path<sub>json</sub> 信息
<ul>
<li>脚本地址：\\solar\pset\group\NaviDevelop\Group\Lib\Guide\User\dongdaoguang\spec<sub>guide</sub><sub>special\export</sub><sub>excel</sub>.py
</li>
<li>脚本流程：
<ul>
<li>读取 Excel（基准）起， 止点信息，
</li>
<li>通过Path URL 获取Path<sub>info（这个不是基准Path）</sub>
</li>
<li>通过Guide URL 获取 Guide<sub>Info（这个不是基准Guide）</sub>
</li>
<li>读取 Excel（基准）中的Guide<sub>Info</sub><sub>base</sub>
</li>
<li>替换 掉 Guide<sub>Info</sub>
</li>
<li>导出 成为 Json
</li>
</ul>

</li>
</ul>

</li>
<li>将得到的Json 上传到 ** 上
<ul>
<li>网址：<a href="http://naviqc-course/UploadCourse">Json上传网址</a>
</li>
<li>选择对应的：country -&gt; group:/*Guide*/ -&gt; courseType:/*基准*/ -&gt; version:/*数据版本*/ -&gt;..
</li>
</ul>

</li>
<li>后面同一般操作
</li>
</ul>


</div>

</div>

<div id="outline-container-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> 特殊情况</h3>
<div class="outline-text-3" id="text-1-5">

<ul>
<li>一般只要设置 起止点。
</li>
<li>有的要设置途径地
</li>
<li>有的实在无法确认的，就要去问组长啦。。。
</li>
</ul>

</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2014-09-04T12:23+0800</p>
<p class="author">Author: </p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
